
[Challenge]
C55_Description=Earn the highest score you can.
C55_Title=Wayne Manor Armory
C56_Description=Clear the room as quickly as possible.
C56_Title=Wayne Manor Main Hall
C73_Description=Use 6 modifiers across 2 levels and acquire every medal.
C73_Title=Wayne Manor Campaign
